In [20]:
import pandas as pd
import numpy as np
import pandas.util.testing

In [21]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)),
                 columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
#freq('H') data yg digenerete memiliki interval setiap jam / 1 jam sekali

df =df.reset_index()
#kita akan mengenerate kolom index baru (0-n)
#maka kolom index jam akan diadopsi sebagai kolom biasa

df['teks']= list('ABCDE')
df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          2.0         13    A
1 2000-01-01 01:00:00          7.0          7    B
2 2000-01-01 02:00:00         13.0         10    C
3 2000-01-01 03:00:00         13.0         11    D
4 2000-01-01 04:00:00          2.0         14    E

In [22]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [23]:
#memilih kolom tipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          2.0         13
1          7.0          7
2         13.0         10
3         13.0         11
4          2.0         14

In [24]:
#memilih kolom tipe data float
df.select_dtypes(include='float')

   bil_pecahan
0          2.0
1          7.0
2         13.0
3         13.0
4          2.0

In [25]:
#memilih kolom tipe data object atau string
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [26]:
#memilih kolom tipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [27]:
#memilih kolom tipe data numerik dan string
df.select_dtypes(include=['datetime','int'])

                index  bil_bulat
0 2000-01-01 00:00:00         13
1 2000-01-01 01:00:00          7
2 2000-01-01 02:00:00         10
3 2000-01-01 03:00:00         11
4 2000-01-01 04:00:00         14